# Cases SQL Statements

## Connection to Database

In [1]:
%load_ext sql

In [2]:
%%sql 

sqlite:///../data/chinook.db

## Case 1: Albums to Purchase

In [8]:
%%sql

WITH track_genre_cte AS
(
    SELECT t.name AS track_name, g.name AS genre_name
    FROM track AS t
    INNER JOIN genre AS g
    ON t.genre_id = g.genre_id
    INNER JOIN invoice_line AS il
    ON il.track_id = t.track_id
    INNER JOIN invoice AS i
    ON i.invoice_id = il.invoice_id
    WHERE billing_country = 'USA'
)

SELECT genre_name, COUNT(track_name) AS tracks
FROM track_genre_cte
GROUP BY genre_name
ORDER BY tracks DESC

 * sqlite:///../data/chinook.db
Done.

[('Rock', 561),
 ('Alternative & Punk', 130),
 ('Metal', 124),
 ('R&B/Soul', 53),
 ('Blues', 36),
 ('Alternative', 35),
 ('Pop', 22),
 ('Latin', 22),
 ('Hip Hop/Rap', 20),
 ('Jazz', 14),
 ('Easy Listening', 13),
 ('Reggae', 6),
 ('Electronica/Dance', 5),
 ('Classical', 4),
 ('Heavy Metal', 3),
 ('Soundtrack', 2),
 ('TV Shows', 1)]

## Case 2: Analyzing Employee Sales Performance

In [20]:
%%sql

SELECT e.first_name|| ' '|| e.last_name AS name, SUBSTRING(invoice_date,1, 4) AS year, SUM(total) AS revenue
FROM employee AS e
INNER JOIN customer AS c
ON e.employee_id = c.support_rep_id
INNER JOIN invoice AS i
ON i.customer_id = c.customer_id
GROUP BY name, year

 * sqlite:///../data/chinook.db
Done.

[('Jane Peacock', '2017', 532.6200000000001),
 ('Jane Peacock', '2018', 413.82000000000005),
 ('Jane Peacock', '2019', 383.13000000000005),
 ('Jane Peacock', '2020', 401.93999999999994),
 ('Margaret Park', '2017', 416.78999999999996),
 ('Margaret Park', '2018', 400.95000000000005),
 ('Margaret Park', '2019', 400.94999999999993),
 ('Margaret Park', '2020', 365.31),
 ('Steve Johnson', '2017', 252.44999999999993),
 ('Steve Johnson', '2018', 332.64),
 ('Steve Johnson', '2019', 437.58000000000015),
 ('Steve Johnson', '2020', 371.25000000000006)]